lalomorales22/penguinOS/boards/waveshare-s3-touch-lcd-147/probe/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_FREERTOS_HZ=1000
# ESP32-S3R8 carries 8MB of OCTAL PSRAM. Quad mode simply fails to
# initialise on this part, so the mode is not a free choice.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
